21-rails many-many/app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def new
    @character = Character.new
    @movies = Movie.all
    @actors = Actor.all
---
SELECT "movies".* FROM "movies"
SELECT "actors".* FROM "actors"

  def create
    character = Character.create(character_params)
---
INSERT INTO "characters" ("name", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["movie_id", 16], ["created_at", "2020-02-25 16:52:24.673307"], ["updated_at", "2020-02-25 16:52:24.673307"]]

  def edit
    @character = Character.find(params[:id])
    @movies = Movie.all
    @actors = Actor.all
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "movies".* FROM "movies"
SELECT "actors".* FROM "actors"

  def update
    # byebug
    @character = Character.find(params[:id])
    @character.update(character_params)
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "characters" SET "actor_id" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["actor_id", 5], ["updated_at", "2020-02-25 21:49:16.578829"], ["id", 23]]