21-rails many-many/app/controllers/movies_controller.rb

    def destroy
        @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]

    def current_movie
        @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]