21-rails many-many/app/controllers/movies_controller.rb

SELECT "actors".* FROM "actors" WHERE 1=0
---
    def new
        @movie = Movie.new
        @actors = Actor.all

INSERT INTO "movies" ("title", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["year", 2020], ["created_at", "2020-02-25 16:29:04.280733"], ["updated_at", "2020-02-25 16:29:04.280733"]]
---
    def create
        movie = Movie.new(movies_params)
        # byebug

        if movie.valid?
            movie.save

SELECT "actors".* FROM "actors"
---
    def edit
        @actors = Actor.all

UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "harry"], ["updated_at", "2020-02-24 23:17:19.677774"], ["id", 8]]
---
    def update
        # byebug
        @movie.update(movies_params)

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 8]]
---
    def destroy
        @movie.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
    def current_movie
        @movie = Movie.find(params[:id])