19-Rails-forms/app/controllers/dogs_controller.rb

    def index
        # @temp = "vidhi"
        @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

    def create
        # byebug
        dog = Dog.create(dogs_params)
---
INSERT INTO "dogs" ("name", "breed", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "richi"], ["breed", "Pug"], ["age", 11], ["created_at", "2020-05-19 15:37:46.008352"], ["updated_at", "2020-05-19 15:37:46.008352"]]

    def update
        # byebug
        # dog = Dog.find(params[:id])
        @dog.update(dogs_params)
---
UPDATE "dogs" SET "age" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["age", 7], ["updated_at", "2020-05-19 16:07:21.432866"], ["id", 8]]

    def destroy
        # byebug
        # dog = Dog.find(params[:id])
        @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 6]]

    def current_dog
        @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]