20-rails-one-many/app/controllers/toys_controller.rb

    def index
        @toys = Toy.all
---
SELECT "toys".* FROM "toys"

    def new
        @toy = Toy.new
        @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

    def create
        # byebug
        toy = Toy.create(toy_params)
---
INSERT INTO "toys" ("name", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mickey mouse"], ["dog_id", 12], ["created_at", "2020-05-19 21:37:36.563815"], ["updated_at", "2020-05-19 21:37:36.563815"]]

    def edit
        # byebug
        @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

    def update
        # byebug
        @toy.update(toy_params)
---
UPDATE "toys" SET "dog_id" = ?, "updated_at" = ? WHERE "toys"."id" = ?  [["dog_id", 14], ["updated_at", "2020-05-19 22:01:04.328036"], ["id", 4]]

    def current_toy
        @toy = Toy.find(params[:id])
---
SELECT "toys".* FROM "toys" WHERE "toys"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]