24-Rails-review/group-1/app/controllers/instructors_controller.rb

INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Josh"], ["created_at", "2020-05-21 20:59:46.613422"], ["updated_at", "2020-05-21 20:59:46.613422"]]
---
    def create
        # byebug
        instructor = Instructor.new(instructor_params)

        if instructor.valid?
            instructor.save

UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Joshua"], ["updated_at", "2020-05-21 21:10:45.391249"], ["id", 4]]
---
    def update
        # byebug
        # .update_attributes + .save => .update
        # @instructor.update_attributes(instructor_params)

        if @instructor.update(instructor_params)

DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 4]]
---
    def destroy
        @instructor.destroy