24-Rails-review/group-1/app/controllers/students_controller.rb

SELECT "instructors".* FROM "instructors"
---
    def new
        @student = Student.new
        @instructors = Instructor.all

INSERT INTO "students" ("name", "age", "major", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dummy"], ["age", 25], ["major", "SE"], ["instructor_id", 2], ["created_at", "2020-05-21 21:43:51.224957"], ["updated_at", "2020-05-21 21:43:51.224957"]]
---
    def create
        # byebug
        @student = Student.new(student_params)

        if @student.valid?
            @student.save