24-Rails-review/group-2/app/controllers/instructors_controller.rb

  def create
    # byebug
    instructor = Instructor.new(instructors_params)

    if instructor.valid?
        instructor.save
---
INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Josh"], ["created_at", "2020-05-21 22:38:15.512055"], ["updated_at", "2020-05-21 22:38:15.512055"]]

  def update
    # .update_attributes + .save = .update

    if @instructor.update(instructors_params)
---
UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Joshua"], ["updated_at", "2020-05-21 22:41:05.761998"], ["id", 4]]

  def destroy
    @instructor.destroy
---
DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 4]]