24-Rails-review/group-2/app/controllers/students_controller.rb

  def new
    @student = Student.new
    @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

  def create
    # byebug
    student = Student.new(students_params)

    if student.valid?
      student.save
---
INSERT INTO "students" ("name", "age", "major", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dummy"], ["age", 25], ["major", "SE"], ["instructor_id", 1], ["created_at", "2020-05-21 23:11:31.207160"], ["updated_at", "2020-05-21 23:11:31.207160"]]

  def edit
    @instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

  def update
      if @student.update(students_params)
---
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "test"], ["updated_at", "2020-05-21 23:14:44.043193"], ["id", 11]]

  def destroy
    @student.destroy
---
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 11]]