21-rails many-many/app/views/movies/show.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."movie_id" = ?  [["movie_id", 1]]
---

<% @movie.characters.each do |character| %>