18-Intro-rails/app/controllers/dogs_controller.rb

    def index
        # @temp = "vidhi"
        @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

    def show
        # byebug
        # puts "Hiiii!!!"
        @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]