44-JWT-Auth/server/app/controllers/api/v1/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
    def index
      @paintings = Painting.all